### Ingest data from College dataset

In [5]:
# Dataset name can't have white space
dataset_id = "college_staging_vee"

In [6]:
# Create dataset
!bq --location=US mk --dataset {dataset_id}

Dataset 'studied-brand-266702:college_staging_vee' successfully created.

### Creating tables and loading data into tables

In [8]:
# Create table
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.Classes \
'gs://cs327e-data-ingest1/Classes.csv'

Waiting on bqjob_r4634bd4f3e79b0ba_000001700db2f947_1 ... (1s) Current status: DONE

In [9]:
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.Current_Students \
'gs://cs327e-data-ingest1/Current_Students.csv'

Waiting on bqjob_r12650375c3575ac2_000001700dc42251_1 ... (2s) Current status: DONE

In [10]:
!bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV {dataset_id}.New_Students \
'gs://cs327e-data-ingest1/New_Students.csv'

Waiting on bqjob_r58a3422b6cff8e19_000001700dc45a9b_1 ... (2s) Current status: DONE

### Get record count for all 3 tables

In [19]:
%%bigquery
select count(*) as count from college_staging_vee.Classes

   count
0     13

In [20]:
%%bigquery
select count(*) as count from college_staging_vee.Current_Students

   count
0     13

In [21]:
%%bigquery
select count(*) as count from college_staging_vee.New_Students

   count
0      7

### Read sample records from tables

In [22]:
%%bigquery
select * from college_staging_vee.Classes
limit 5

,tid,instructor,dept,cno,cname,credits
0,fares,Fares Fraij,CS,CS331E,Elements of Software Engineering,3
1,abraham,Prof. Sarah Abraham,CS,CS329E,Elements of Mobile Computing,3
2,mitra,"Mitra, Shyamal",CS,CS313E,Elements of Software Design,3
3,cannata,PHILIP CANNATA,CS,CS326E,Elements of Networking,3
4,cannata,"Cannata, Philip",CS,CS347,Data Management,3

In [23]:
%%bigquery
select * from college_staging_vee.New_Students
limit 5

        sid    fname     lname         dob
0    aprilz    April     Lopez  2000-01-10
1  sudeepa4  Sudeepa       Roy  2000-10-01
2    ryan22     Ryan    Watson  2000-11-07
3     dchen    David      Chen  2000-08-22
4     natea   Nathan  Anderson  2000-04-08

In [26]:
%%bigquery
select * from college_staging_vee.Current_Students
limit 5

,sid,fname,lname,dob,cno,cname,credits,grade
0,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
1,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A
2,paulg,Paul,Gore,2000-09-17,CS326E - Fall18,Elements of Networking,3,A-
3,paulg,Paul,Gore,09/17/2000,CS313E,Elements of Software Design,3,None
4,bzen26,Biswa,Zen,04/22/1998,CS313E - Fall18,Elements of Software Design,3,B+

### Quiz

In [46]:
%%bigquery
# Who takes CS327E or CS329E
select * from college_staging_vee.Current_Students where cno = "CS327E" or cno="CS329E"
order by sid

,sid,fname,lname,dob,cno,cname,credits,grade
0,jc,James,Cowe,2000-04-22,CS327E,CS327E – Elements of Databases,3,None
1,jerryh,Jerry,Hargrove,01/03/1999,CS327E,Elements of Databases,3,B
2,jerryh,Jerry,Hargrove,01/03/1999,CS327E,Elements of Databases,0,None
3,jerryh,Jerry,Hargrove,1999-01-03,CS329E,Elements of Web Programming,3,A-
4,kev18,Kevin,Lin,05/10/1999,CS329E,Elements of Web Programming,3,None
5,paulg,Paul,Gore,2000-09-17,CS329E,Elements of Web Programming,3,A

In [50]:
%%bigquery
# Who takes CS327E and CS329E
SELECT sid 
From college_staging_vee.Current_Students
WHERE cno = "CS327E" AND cno = "CS329E"
GROUP BY sid
# Wrong - need to use JOIN

Empty DataFrame
Columns: [sid]
Index: []